#include<reg51.h>
#include"config.h"
#include"TimeDLY.h"
#include"IOCfg.c"
#include"LCD1602.h"
/*******************************************************************************
* 函 数 名         : LcdWriteCom
* 函数功能		   : 向LCD写入一个字节的命令
* 输    入         : com
* 输    出         : 无
*******************************************************************************/

void LcdWriteCom(INT8U com)	  //写入命令
{
      LCD1602_RS=0;
	  LCD1602_E=0;
	  LCD1602_DATAPINS =com;
	  Delay1ms(5);
	  LCD1602_E=1;
	  Delay1ms(5);
	  LCD1602_E=0;
}


/*******************************************************************************
* 函 数 名         : LcdWriteData
* 函数功能		   : 向LCD写入一个字节的数据
* 输    入         : dat
* 输    出         : 无
*******************************************************************************/		   
		   
void LcdWriteData(INT8U dat)			//写入数据
{
	  LCD1602_RS=1;
	  LCD1602_E=0;
	  LCD1602_DATAPINS =dat;
	  Delay1ms(5);
	  LCD1602_E=1;
	  Delay1ms(5);
	  LCD1602_E=0;
}

/*******************************************************************************
* 函 数 名       : LcdInit()
* 函数功能		 : 初始化LCD屏
* 输    入       : 无
* 输    出       : 无
*******************************************************************************/		   
void LcdInit()						  //LCD初始化子程序
{
 	LcdWriteCom(0x38);  //开显示
	LcdWriteCom(0x0c);  //开显示不显示光标
	LcdWriteCom(0x06);  //写一个指针加1
	LcdWriteCom(0x01);  //清屏
	//LcdWriteCom(0x80);  //设置数据指针起点
}
